benchmark-results/round-3-amd/redis.txt
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       865090.66          ---          ---         1.78713         1.79100         1.82300         1.83900         3.43900         3.66300         3.75900         4.22300         4.99100         7.61500     57353.66 
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     865090.66         0.00         0.00         1.78713         1.79100         1.82300         1.83900         3.43900         3.66300         3.75900         4.22300         4.99100         7.61500     57353.66 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        80785.59          ---          ---         1.73553         1.73500         1.76700         1.78300         3.26300         3.53500         3.63100         3.85500         4.76700         6.55900      5364.17 
Gets       807846.97      4412.45    803434.52         1.73548         1.73500         1.76700         1.78300         3.26300         3.53500         3.63100         3.85500         4.76700         6.55900     32434.48 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     888632.55      4412.45    803434.52         1.73549         1.73500         1.76700         1.78300         3.26300         3.53500         3.63100         3.85500         4.76700         6.55900     37798.65 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        13109.19          ---          ---         1.33884         1.33500         1.35900         1.37500         1.46300         2.71900         2.78300         2.79900         2.84700         3.08700       870.44 
Gets       131074.59       772.83    130301.77         1.33783         1.33500         1.35900         1.37500         1.46300         2.71900         2.78300         2.79900         2.84700         3.75900      5263.73 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     144183.78       772.83    130301.77         1.33792         1.33500         1.35900         1.37500         1.46300         2.71900         2.78300         2.79900         2.84700         3.75900      6134.17 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        78636.67          ---          ---         1.78637         1.77500         1.83900         1.86300         3.34300         3.71100         3.77500         3.79100         3.83900         4.86300      5213.45 
Gets       786358.02    786358.02         0.00         1.78633         1.77500         1.83900         1.86300         3.34300         3.71100         3.77500         3.79100         3.83900         4.86300     48294.20 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     864994.69    786358.02         0.00         1.78633         1.77500         1.83900         1.86300         3.34300         3.71100         3.77500         3.79100         3.83900         4.86300     53507.66 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        12997.69          ---          ---         1.35209         1.34300         1.36700         1.38300         1.47100         2.73500         2.81500         2.89500         4.73500         5.69500       861.68 
Gets       129959.73    129959.73         0.00         1.35138         1.34300         1.36700         1.38300         1.47100         2.73500         2.81500         2.89500         4.60700         5.75900      7981.42 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     142957.42    129959.73         0.00         1.35144         1.34300         1.36700         1.38300         1.47100         2.73500         2.81500         2.89500         4.60700         5.75900      8843.11